brew "zsh"
brew "zsh-async"
brew "zsh-history-substring-search"
brew "antigen"
brew "reattach-to-user-namespace"
brew "tmux"
brew "smug"
brew "vim"
brew "neovim"
brew "fnm"
brew "fzf"
brew "the_silver_searcher"
brew "jq"
brew "rename"
brew "fd"
brew "bat"
brew "upsun-cli"
brew "gemini-cli"
brew "exercism"
brew "fx"
